Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/trad-cap2-cap7-cap10-calidadMEDIA.tmx
Source language: ca
Languages: es_es

source: Se n'ha de considerar la resolució, és a dir, el nombre de punts, elements d'imatge (píxels) que caben en una imatge, per exemple $1024 768$ (horitzontal $$ vertical), la profunditat de color (en bits: per exemple 24 bits permeten $2^{24}=16 777 216$ colors diferents) i altres paràmetres com la { freqüència de refrescament} (que es mesura en hertzs o cicles per segon; vegeu ``megahertz'').
es_es: Se tiene que considerar la resolución , es decir, el número de puntos, elementos de imagen (píxeles) que caben en una imagen, por ejemplo $1024 768$ (horizontal $$ vertical), la profundidad de color (en bits: por ejemplo 24 bits permiten $2^{24}=16 777 216$ colores diferentes) y otros parámetros como la frecuencia { de refrescament} (que se mide en hertzs o ciclos por segundo; ved ``megahercio'').

source: Se'n podrien fer dos grups: [Programari d'ús específic:] programari dissenyat per a un usuari molt concret amb unes necessitats molt concretes: per exemple, el programa que gestiona els préstecs, les quotes i les adquisicions d'un videoclub, fet a mida per a ell.
es_es: Se podrían hacer dos grupos: [Software de uso específico:] software diseñado para un usuario muy concreto con unas necesidades muy concretas: por ejemplo, el programa que gestiona los préstamos, las cuotas y las adquisiciones de un videoclub, hecho a medida para él.

source: Segons Arnold (2003) els problemes als quals s'enfronta la traducció automàtica són quatre.
es_es: Según Arnold (2003) los problemas a los cuales se enfrenta la traducción automática son cuatro.

source: Segons aquest autor, la traducció automàtica té quatre grans problemes: La forma no determina completament el contingut (és a dir, la interpretació): no sempre és fàcil determinar la interpretació que es volia que tinguera el que s'ha escrit.
es_es: Según este autor, la traducción automática tiene cuatro grandes problemas: La forma no determina completamente el contenido (es decir, la interpretación): no siempre es fácil determinar la interpretación que se pretendía que tuviera lo que se ha escrito.

source: Segons aquest model, les persones consideraríem sempre totes les estructures sintàctiques.
es_es: Según este modelo, las personas consideraríamos siempre todas las estructuras sintácticas.

source: Si apareix entre un article i un adjectiu com ara en el ahorro doméstico no hi ha cap dubte que es tracta d'un substantiu: la seqüència determinant--verb personal no és permesa.
es_es: Si aparece entre un artículo y un adjetivo como por ejemplo en el ahorro doméstico no hay ninguna duda que se trata de un sustantivo: la secuencia determinante--verbo personal no está permitida.

source: Si assignem un número a cada alumne, quants octets (bytes) fan falta per a guardar el número de cada alumne?
es_es: Si asignamos un número a cada alumno, ¿cuántos bytes hacen falta para guardar el número de cada alumno?

source: Si el disc es diu C: (típic en el cas del disc dur d'un PC amb sistema operatiu Windows), les trajectòries d'aquests dos fitxers serien C:{prac1}{tt}tt1.txt i C:{prac1}{reserva}{tt}tt1.txt, i, per tant, serien diferents.
es_es: Si el disco se llama C: (típico en el caso del disco llevar de un PC con sistema operativo Windows), las trayectorias de estos dos ficheros serían C:{prac1}{tt}tt1.txt y C: {prac1}{reserva}{tt}tt1.txt, y, por lo tanto, serían diferentes.

source: Si el sistema que resol l'ambigüitat és capaç d'usar informació semàntica, podria elegir correctament en aquest cas.
es_es: Si el sistema que resuelve la ambigüedad es capaz de usar información semántica, podría elegir correctamente en este caso.

source: Si les imatges enviades per una vella càmera digital sense colors (blanc i negre) tenen 100$$100 píxels, quantes d'aquestes imatges podríem emmagatzemar en una memòria USB d'1 GB?
es_es: Si las imágenes enviadas por una vieja cámara digital sin colores (blanco y negro) tienen 100$$100 píxeles, ¿cuántas de estas imágenes podríamos almacenar en una memoria USB de 1 GB?

source: Si necessitem guardar objectes o unitats d'informació que tenen més de dos valors possibles, no tindrem prou amb 1 bit; haurem de combinar més d'un bit.
es_es: Si necesitamos guardar objetos o unidades de información que tienen más de dos valores posibles, no tendremos suficiente con 1 bit; tendremos que combinar más de uno.

source: Si prenem un corpus (conjunt) suficientment gran de textos on un expert ha indicat la categoria lèxica de cada mot i comptem quantes voltes apareixen totes les seqüències possibles de dues categories lèxiques, podem usar aquestes freqüències per a assignar la categoria d'un mot ambigu: de totes les seqüències de tres mots possibles que es puguen formar amb aquest mot, en prendrem la més freqüent.
es_es: Si cogemos un corpus (conjunto) suficientemente grande de textos en el que un experto ha indicado la categoría léxica de cada palabra y contamos cuántas veces aparecen todas las secuencias posibles de dos categorías léxicas, podemos usar estas frecuencias para asignar la categoría de una palabra ambigua: de todas las secuencias de tres palabras posibles que se puedan formar con esta palabra, cogeremos la más frecuente.

source: Si quan s'ha demanat la 2.000.000 es copien en la memòria cau les 524.288 posicions que van de la 1.572.864 a la 2.097.151, l'accés a la posició 2.000.003 serà més ràpida.
es_es: Si cuando se ha pedido la 2.000.000 se copian en el caché las 524.288 posiciones que van de la 1.572.864 a la 2.097.151, el acceso a la posición 2.000.003 será más rápido.

source: Si reduïm de 3.000 MHz a 1.500 MHz la freqüència del rellotge d'un ordinador i encara funciona{} {} executarà els programes a la mateixa velocitat.
es_es: Si reducimos de 3.000 MHz a 1.500 MHz la frecuencia del reloj de un ordenador y todavía funciona{} {} ejecutará los programas a la misma velocidad.

source: Si suposem que hem triat una resolució i un format d'imatge que fa que cada fotografia necessite un espai de 2.048 kB, quantes targetes d'aquestes hem de comprar si volem fer 2.500 fotos al llarg d'un viatge?
es_es: Si suponemos que hemos elegido una resolución y un formato de imagen que hace que cada fotografía necesito un espacio de 2.048 kB, ¿cuántas tarjetas de estas tenemos que comprar si queremos hacer 2.500 fotos a lo largo de un viaje?

source: Si són de colors, cal més d'un bit per a cada punt.
es_es: Si son de colores, hace falta más de un bit por cada punto.

source: Si tornem a carregar les bateries i encenem l'ordinador, fan l'operació inversa.
es_es: Si volvemos a cargar las baterías y encendemos el ordenador, hacen la operación inversa.

source: Si traduim automàticament la frase catalana Hilari no coneix bé la Mariona: cada dia troba sorprenent el que fa i obtenim en anglés Hilari does not know Mariona well: every day he finds what he does astonishing o en francés Hilari ne connaît pas bien Mariona: tous les jours elle trouve ce qu'il fait etonnant, quin tipus d'ambigüitat ha estat mal resolta?
es_es: Si *traduim automáticamente la frase catalana Hilari no coneix bé la Mariona: cada dia troba sorprenento el que fa y obtenemos en inglés Hilari does not know Mariona well: every day he finds what he does astonishing o en francés Hilari ne connaît bien Mariona: tous les jours elle trouve ce qu''il fait etonnant, ¿qué tipo de ambigüedad ha sido mal resuelta?

source: Si traduïm automàticament la frase espanyola Ayer cantamos las mismas canciones i obtenim en anglés Yesterday we sing the same songs o en francés Hier nous chantons les mêmes chansons, quin tipus d'ambigüitat ha estat mal resolta?
es_es: Si traducimos automáticamente la frase española Ayer cantamos las mismas canciones y obtenemos en inglés Yesterday we sing the same songs o en francés Hier nous chantons las mêmes chansons, ¿qué tipo de ambigüedad ha sido mal resuelta?

source: Si trobem { podem} ({ volem}) seguit d'infinitiu, és molt més probable que es tracte del verb { poder} ({ voler}) que del verb { podar} ({ volar}); de nou, caldria usar una categoria gramatical especial, en aquest cas per als verbs modals.
es_es: Si encontramos { podem} ({ volem}) seguido de infinitivo, es mucho más probable que se trate del verbo { poder} ({ voler}) que del verbo { podar} ({ volar}); de nuevo, habría que usar una categoría gramatical especial, en este caso para los verbos modales.

source: Si un mot té només una forma lèxica i una única traducció a una determinada llengua, pot ser encara ambigu?
es_es: Si una palabra tiene sólo una forma léxica y una única traducción a una determinada lengua, puede ser todavía ambiguo?

source: Si una carpeta està dividida en subcarpetes, no pot contenir documents; els documents haurien d'anar dins de les subcarpetes Només en la carpeta arrel.
es_es: Si una carpeta está dividida en subcarpetas, no puede contener documentos; los documentos tendrían que ir dentro de las subcarpetas Sólo en la carpeta raíz.

source: Si una forma superficial és ambigua però té només una forma lèxica{} {} es tracta d'un mot homògraf.
es_es: Si una forma superficial es ambigua pero tiene tan solo una forma léxica{} {} se trata de una palabra homógrafa.

source: Si una memòria USB té 6 gigabytes (gigaoctets), una pàgina de text (europeu occidental) típica té 50 línies de 60 caràcters (contant els blancs) i cada caràcter ocupa 1 byte (octet), quantes pàgines caben aproximadament en la memòria?
es_es: Si una memoria USB tiene 6 gigabytes, una página de texto (europeo occidental) típica tiene 50 líneas de 60 caracteres (contando los blancos) y cada carácter ocupa 1 byte, ¿cuántas páginas caben aproximadamente en la memoria?

source: Si una oració té només una ambigüitat lèxica pura té un únic arbre d'anàlisi sintàctica, però més d'una anàlisi morfològica.
es_es: Si una oración tiene sólo una ambigüedad léxica pura tiene un único árbol de análisis sintáctico, pero más de un análisis morfológico.

source: Si una oració és ambigua quan té més d'una interpretació possible, això pot tenir dues causes bàsiques: un o més mots de l'oració tenen més d'una interpretació possible (és a dir, són lèxicament ambigus).
es_es: Si una oración es ambigua cuando tiene más de una interpretación posible puede deberse a dos motivos básicos: una o más palabras de la oración tienen más de una interpretación posible (es decir, son léxicamente ambiguos).

source: Solen venir amb un sistema operatiu gràfic: el més comú és Android, però els de la marca Apple usen iOS.
es_es: Suelen venir con un sistema operativo gráfico: el más común es Android, pero los de la marca Apple usan iOS.

source: Solucions
es_es: Soluciones

source: Suposarem que, com a resultat del treball anterior de traducció, tenim parells de textos $(E,D)$ on $E$ és el text esquerre (en la llengua esquerra) i $D$ és el text dret (en la llengua dreta), i volem traduir de la llengua esquerra a la llengua dreta. De fet, quan dos textos $E$ i $D$ són equivalents (és a dir, traducció un de l'altre) direm que el parell $(E,D)$ és un bitext o text paral·lel.
es_es: Supondremos que, como resultado del trabajo anterior de traducción, tenemos pares de textos $(E,D)$ donde $E$ es el texto izquierdo (en la lengua izquierda) y $D$ es el texto derecho (en la lengua derecha), y queremos traducir de la lengua izquierda a la lengua derecha. De hecho, cuando dos textos $E$ y $D$ son equivalentes (es decir, traducción uno del otro) diremos que el par $(E,D)$ es un bitexto o texto paralelo.

source: Són, amb diferència, els ordinadors més habituals.
es_es: Son, con diferencia, los ordenadores más habituales.

source: També explica per què l'oració El gos va mossegar l'home no té la mateixa interpretació que la frase L'home va mossegar el gos Aquestes oracions no volen dir el mateix perquè, malgrat tenir els mateixos mots, l'estructura sintàctica no és la mateixa.
es_es: También explica por qué la oración El perro mordió al hombre no tiene la misma interpretación que la frase El hombre mordio al perro Estas oraciones no tienen el mismo significado porque, aunque las palabras sean las mismas, la estructura sintáctica no es la misma.

source: També hi ha una alternativa interessant de codi obert i distribució gratuïta, anomenada OmegaT.} Aquests programes de traducció assistida són molt populars entre les persones que es dediquen professionalment a la traducció, molt més populars que els programes de traducció automàtica.
es_es: También hay una alternativa interesante de código abierto y distribución gratuita, llamada OmegaT.] Estos programas de traducción asisitida son muy populares entre las personas que se dedican profesionalmente a la traducción, mucho más populares que los programas de traducción automática.

source: També hi intervé l'ambigüitat lèxica pura (polisèmia) de despedir (en la primera llançar; en la segona, deixar sense treball).
es_es: También interviene la ambigüedad léxica pura (polisemia) de despedir (en la primera lanzar; en la segunda, dejar sin trabajo).

source: Tant en el cas interactiu com en el de la pretraducció, qui tradueix ha d'acabar la traducció.
es_es: Tanto en el caso interactivo como en el de la pretraducción, quién traduce ha de acabar la traducción.

source: Tipus d'ordinadors
es_es: Tipos de ordenador

source: Tota la informació ---instruccions de programa o dades--- que s'emmagatzema en la memòria d'un ordinador s'hi guarda en forma binària; és a dir, cada dada és una cadena de dígits binaris o bits.
es_es: Toda la información ---instrucciones de programa o datos--- que se almacena en la memoria de un ordenador se guarda de forma binaria; es decir, cada dato es una cadena de dígitos binarios o bits.

source: Tots aquests conceptes es veuen potser més clars amb l'exemple de la figura en què es mostra l'estructura de fitxers i directoris en un dispositiu d'emmagatzemament qualsevol.
es_es: Todos estos conceptos se ven quizás más claros con el ejemplo de la figura en que se muestra la estructura de ficheros y directorios en un dispositivo de almacenamiento cualquiera.

source: Tots els sistemes informàtics tenen maquinari de les classes següents:
es_es: Todos los sistemas informáticos tienen hardware de los siguientes tipos:

source: Tots els sistemes informàtics es poden dividir en dues parts: maquinari i programari.
es_es: Todos los sistemas informáticos se pueden dividir en dos partes hardware y software.

source: Traducció amb memòries de traducció
es_es: Traducción con memorias de traducción

source: Tres bits per dígit decimal no són suficients (permeten només 8 combinacions); quatre, sí.
es_es: Tres bits por dígito decimal no son suficientes (permiten sólo 8 combinaciones); cuatro, sí.

source: Tres bits per mes no són suficients (permeten només 8 combinacions); quatre sí (permeten 16 combinacions).
es_es: Tres bits por mes no son suficientes (permiten sólo 8 combinaciones); cuatro sí (permiten 16 combinaciones).

source: Un adjunt és un sintagma o constituent que, conjuntament amb un altre sintagma o constituent, forma un constituent del mateix tipus que aquest últim (per exemple, un sintagma nominal més un sintagma preposicional formen un sintagma nominal); en un cert sentit, l'adjunt no és necessari sinó opcional.
es_es: Un adjunto es un sintagma o constituyente que, conjuntamente con otro sintagma o constituyente, forma un constituyente del mismo tipo que este último (por ejemplo, un sintagma nominal más un sintagma preposicional forman un sintagma nominal); en un cierto sentido, el adjunto no es necesario sino opcional.

source: Un programa és una seqüència (llista o conjunt ordenat) d'instruccions que són seguides o executades pel maquinari, de tal manera que realitzen alguna tasca determinada. Normalment, els ordinadors estan organitzats al voltant d'un processador central (vegeu més endavant) que és capaç de comprendre i executar instruccions bàsiques preses d'un conjunt determinat (el conjunt d'instruccions del processador).
es_es: Un programa es una secuencia (lista o conjunto ordenado) de instrucciones que el hardware sigue o ejecuta, de tal manera que realizan alguna tarea determinada. Normalmente, los ordenadores están organizados alrededor de un procesador central (véase más adelante) que es capaz de comprender y ejecutar instrucciones básicas tomadas de un conjunto determinado (el conjunto de instrucciones del procesador).

source: Un CD-ROM de música és d'accés aleatori perquè podem accedir a la setzena cançó directament; en canvi, un casset (cinta magnètica) és d'accés seqüencial perquè per a accedir a la setzena cançó hem de passar per les 15 cançons anteriors.
es_es: Un CD-ROM de música es de acceso aleatorio porque podemos acceder a la decimosexta canción directamente; en cambio, un casette (cinta magnética) es de acceso secuencial porque para acceder a la decimosexta canción directamente tenemos que pasar por las 15 anteriores.

source: Un altre exemple: l'oració Han posat un banc nou a la plaça pot tenir dues interpretacions, segons la interpretació que s'assigne al mot polisèmic banc (``seient estret i llarg'' o bé ``institució financera'').
es_es: Otro ejemplo: la oración Han puesto un banco nuevo en la plaza puede tener dos interpretaciones, según la interpretación que se asigne a la palabra polisémica banco (``asiento estrecho y largo'' o bien ``institución financiera'').

source: Un altre tipus d'ambigüitat mixta succeeix quan l'ambigüitat lèxica categorial d'alguns mots es combina amb mecanismes d'el·lipsi com els descrits més amunt per a construccions coordinatives o comparatives.
es_es: Otro tipo de ambigüedad mixta tiene lugar cuando la ambigüedad léxica categorial de algunas palabras se combina con mecanismos de elipsis como los descritos más arriba para construcciones coordinadas o comparativas.

source: Un bit pot tenir dos valors: 0 (apagat, inactiu) o 1 (encés, actiu); això és perquè el dispositiu electrònic corresponent pot estar en dos estats.
es_es: Un bit puede tener dos valores: 0 (apagado, inactivo) o 1 (encendido, activo); esto es porque el dispositivo electrónico correspondiente puede estar en dos estados.

source: Un carácter, en les codificacions usades comunament en Europa occidental, ocupa un octet; per tant, la pàgina de $5060$ ocupa 3.000 octets.
es_es: Un carácter, en las codificaciones usadas comúnmente en Europa occidental, ocupa un byte; por lo tanto, la página de $5060$ ocupa 3.000 bytes.

source: Un dels paràmetres més interessants d'un mòdem és la velocitat de transmissió de dades, que es mesura en b/s (bits per segon).
es_es: Uno de los parámetros más interesantes de un módem es la velocidad de transmisión de datos, que se mide en bps (bits por segundo).

source: Un exemple clàssic és l'edició bilingüe (espanyol--català) d'El Periódico de Catalunya (vegeu l'epígraf ), que es prepara diàriament amb un mètode completament automàtic que funciona en molts aspectes de manera similar a una memòria de traducció.
es_es: Un ejemplo clásico es la edición bilingüe (español--catalán) de El Periódico de Cataluña (véase el epígrafe ), que se prepara diariamente con un método completamente automático que funciona en muchos aspectos de manera similar a una memoria de traducción.

source: Un megahertzs equival a un milió de hertzs (Hz), és a dir, un milió de cicles de processament d'informació per segon.
es_es: Un megaherzio equivale a un millón de herzios (Hz), es decir, un millón de ciclos de procesamiento de información por segundo.

source: Un mot (i, en general, una unitat lèxica de més d'un mot) es pot veure des de dues perspectives; d'una banda, la forma superficial del mot és la forma concreta que apareix en el text: cantàvem; d'altra banda, hi ha la forma lèxica, que consisteix en un lema o forma canònica (cantar), una categoria lèxica, classe de mot, o part de l'oració (verb) i uns indicadors de flexió que expressen les característiques morfològiques o flexives (primera persona, nombre plural, temps pretèrit imperfet, mode indicatiu).
es_es: Una palabra (y, en general, una unidad léxica de más de una palabra) se puede ver desde dos perspectivas; por un lado, la forma superficial de la palabra es la forma concreta que aparece en el texto: cantábamos; por otra parte, tenemos la forma léxica, que consiste en un lema o forma canónica (cantar), una categoría léxica, clase de palabra, o parte de la oración (verbo) y unos indicadores de flexión que expresan las características morfológicas o flexivas (primera persona, nombre plural, tiempo pretérito imperfecto, modo indicativo).

source: Un mòdem és un dispositiu que{} {} converteix la informació digital en senyals analògics.
es_es: Un módem es un dispositivo que{} {} convierte la información digital en señales analógicas.

source: Un octet pot contenir, per tant, molt poca informació (un caràcter, una instrucció senzilla del processador central, un nombre de 0 (``{ 00000000}'') a 255 (``{ 11111111}''), etc.).
es_es: Un byte puede contener, por tanto, muy poca información (un caracter, una instrucción sencilla del procesador central, un número de 0 (``{ 00000000}'') a 255 (``{ 11111111}''), etc.).

source: Un octet pot estar, per tant, en $2^8=256$ estats diferents.
es_es: Un byte puede estar, por lo tanto, en $2^8=256$ estados diferentes.

source: Un petit glossari
es_es: Un pequeño glosario

source: Un traductor automàtic per transferència morfològica avançada resol la polisèmia mitjançant l'ús d'un analitzador morfològic.
es_es: Un traductor automático por transferencia morfológica avance resuelve la polisemia mediante el uso de un analizador morfológico.

source: Una memòria de traducció és una base de dades en la qual cada fitxa (registre) conté una unitat de traducció, i té, per tant, com a mínim dos camps: el text esquerre i el text dret.
es_es: Una memoria de traducción es una base de datos en la que cada ficha (registro) contiene una unidad de traducción, y tiene, por tanto, como mínimo dos campos: el texto izquierdo y el texto derecho.

source: Una altra regla que se sol usar és la d'adjunció mínima ---en anglés minimal attachment--- que afavoreix l'arbre sintàctic amb el mínim de nodes (punts de ramificació).
es_es: Otra regla que se suele usar es la de adjunción mínima ---en inglés minimal attachment--- que favorece el árbol sintáctico con el mínimo de nodos (puntos de ramificación).

source: Una ambigüitat que és molt semblant a l'ambigüitat lèxica pura es produeix quan una expressió idiomàtica es pren bé com a tal o bé en sentit literal.
es_es: Una ambigüedad que es muy parecida a la ambigüedad léxica pura se produce cuando una expresión idiomática se toma o bien como tal o bien en sentido literal.

source: Una aproximació a la traducció humana assistida per ordinador (és a dir, semiautomàtica) que està molt relacionada amb la traducció directa és la que s'usa en les anomenades memòries de traducció. La noció bàsica {somers96b,samuelson-brown96b} és la utilitat de tenir a mà, quan s'està traduint un text nou, exemples de frases similars i de les traduccions corresponents, provinents de traduccions realitzades anteriorment.
es_es: Una aproximación a la traducción humana asistida por ordenador (es decir, semiautomática) que está muy relacionada con la traducción directa es la que se usa en las llamadas memorias de traducción. La noción básica {somers96b,samuelson-brown96b} es la utilidad de tener a mano, cuando se está traduciendo un nuevo texto, ejemplos de frases similares y de las traducciones correspondientes, provenientes de traducciones ya realizadas anteriormente.

source: Una classificació interessant dels problemes de la traducció automàtica la dóna .
es_es: Una clasificación interesante de los problemas que se dan en la traducción automática .
